package oop11;

public class oop11 {
    /*
     	 	                                                     private	default	 protected	public
1.	Один и тот же класс	 	 	 	                                1    |     1    |     1    |  1
2.	Подкласс, находящийся в том же пакете, что и суперкласс	 	 	0 	 |     1    |     1    |  1
3.	Класс из того же самого пакета, не являющийся подклассом.	 	0    |     1    |     1    |  1
4.	Подкласс, находящийся в другом пакете.	 	 	 	            0    |     0    |     1    |  1
5.	Класс из другого пакета, не являющийся подклассом данного.	 	0    |     0 	|     0    |  1
     */
}
